CSI API ETABS v1
cCaseStaticNonlinearStaged.GetStageDefinitions_1 Method
 Retrieves the stage definition data for the specified load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetStageDefinitions_1(
	string Name,
	ref int NumberStages,
	ref int[] Duration,
	ref bool[] Output,
	ref string[] OutputName,
	ref string[] Comment
)
Function GetStageDefinitions_1 (
	Name As String,
	ByRef NumberStages As Integer,
	ByRef Duration As Integer(),
	ByRef Output As Boolean(),
	ByRef OutputName As String(),
	ByRef Comment As String()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NumberStages As Integer
Dim Duration As Integer()
Dim Output As Boolean()
Dim OutputName As String()
Dim Comment As String()
Dim returnValue As Integer
returnValue = instance.GetStageDefinitions_1(Name,
	NumberStages, Duration, Output, OutputName,
	Comment)
int GetStageDefinitions_1(
	String^ Name,
	int% NumberStages,
	array<int>^% Duration,
	array<bool>^% Output,
	array<String^>^% OutputName,
	array<String^>^% Comment
)
abstract GetStageDefinitions_1 :
        Name : string *
        NumberStages : int byref *
        Duration : int[] byref *
        Output : bool[] byref *
        OutputName : string[] byref *
        Comment : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing static nonlinear staged load case
NumberStages
Type: System.Int32
 The number of stages defined for the specified load case
Duration
Type: System.Int32[]
 This is an array that includes the duration in days for each stage
Output
Type: System.Boolean[]
 This is an array that includes True or False, indicating if analysis output is to be saved for each stage
OutputName
Type: System.String[]
 This is an array that includes a user-specified output name for each stage
Comment
Type: System.String[]
 This is an array that includes a comment for each stage. The comment may be a blank string.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value
Remarks
 This function is obsolete and has been superseded by GetStageDefinitions_2(String, Int32, Double[], Boolean[], String[], String[]) as of version 16.0.2. This function is maintained for backwards compatibility.
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace